<!-- attach-outputs:plan-nodes-prod.txt -->
  <!-- Output: plan-nodes-prod.txt -->
  #### plan-nodes-prod.txt 📖: `test: success, prod: success`

  **Last updated:** Jan 3, 2026, 10:36 PM UTC

  <details><summary>Show Contents</summary>

  ```

  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso"
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g2p-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g2p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso"
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-1"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-1"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso"
      + verify              = true
    }

  # proxmox_virtual_environment_download_file.talos_iso["nuc-g3p-2"] will be created
  + resource "proxmox_virtual_environment_download_file" "talos_iso" {
      + content_type        = "iso"
      + datastore_id        = "local"
      + file_name           = "talos-p-v1.12.0-nocloud-amd64-10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67.iso"
      + id                  = (known after apply)
      + node_name           = "nuc-g3p-2"
      + overwrite           = true
      + overwrite_unmanaged = false
      + size                = (known after apply)
      + upload_timeout      = 600
      + url                 = "https://factory.talos.dev/image/10e1d628a0f7dfea781961446a8587d491ec987b40a70ca3dd51194221965f67/v1.12.0/nocloud-amd64.iso"
      + verify              = true
    }

  # module.cluster.onepassword_item.misc_config[0] will be created
  + resource "onepassword_item" "misc_config" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-misc-config"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "config"

          + field {
              + id    = (known after apply)
              + label = "pod_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "targetRevision"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "cluster_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "external_ip_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "vault_name"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "project_id"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "cluster_nfs_path"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "datasets_nfs_path"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "nfs_server"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "service_cidr"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "control_plane_vip"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "control_plane_vip_link"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "talos_install_image"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "control_plane_ips"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "bootstrap_ip"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "worker_ips"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.onepassword_item.talosconfig[0] will be created
  + resource "onepassword_item" "talosconfig" {
      + category   = "secure_note"
      + id         = (known after apply)
      + note_value = (sensitive value)
      + password   = (sensitive value)
      + title      = "tiles-talosconfig"
      + uuid       = (known after apply)
      + vault      = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[0] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[1] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[2] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.cloudflare_dns_record.delegation[3] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = (known after apply)
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.cluster.module.k8s.google_dns_managed_zone_iam_member.cert_manager_dns01_public will be created
  + resource "google_dns_managed_zone_iam_member" "cert_manager_dns01_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles"
      + member       = "serviceAccount:sa-tiles-cert-manager@tiles-main-1de4.iam.gserviceaccount.com"
      + project      = "tiles-main-1de4"
      + role         = "roles/dns.admin"
    }

  # module.cluster.module.k8s.google_dns_managed_zone_iam_member.external_dns_public will be created
  + resource "google_dns_managed_zone_iam_member" "external_dns_public" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + managed_zone = "tiles"
      + member       = "serviceAccount:sa-tiles-external-dns@tiles-main-1de4.iam.gserviceaccount.com"
      + project      = "tiles-main-1de4"
      + role         = "roles/dns.admin"
    }

  # module.cluster.module.k8s.google_project_iam_member.cert_manager_dns01_dns_reader will be created
  + resource "google_project_iam_member" "cert_manager_dns01_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-cert-manager@tiles-main-1de4.iam.gserviceaccount.com"
      + project = "tiles-main-1de4"
      + role    = "roles/dns.reader"
    }

  # module.cluster.module.k8s.google_project_iam_member.external_dns_dns_reader will be created
  + resource "google_project_iam_member" "external_dns_dns_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:sa-tiles-external-dns@tiles-main-1de4.iam.gserviceaccount.com"
      + project = "tiles-main-1de4"
      + role    = "roles/dns.reader"
    }

  # module.cluster.module.k8s.google_service_account.cert_manager_dns01 will be created
  + resource "google_service_account" "cert_manager_dns01" {
      + account_id   = "sa-tiles-cert-manager"
      + description  = "Service account for tiles cert-manager to perform DNS01 ACME challenges"
      + disabled     = false
      + display_name = "tiles cert-manager DNS01 Solver"
      + email        = "sa-tiles-cert-manager@tiles-main-1de4.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-cert-manager@tiles-main-1de4.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tiles-main-1de4"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account.external_dns will be created
  + resource "google_service_account" "external_dns" {
      + account_id   = "sa-tiles-external-dns"
      + description  = "Service account for tiles external-dns to manage DNS records"
      + disabled     = false
      + display_name = "tiles external-dns"
      + email        = "sa-tiles-external-dns@tiles-main-1de4.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:sa-tiles-external-dns@tiles-main-1de4.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "tiles-main-1de4"
      + unique_id    = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.cert_manager_dns01_sa_key will be created
  + resource "google_service_account_key" "cert_manager_dns01_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.google_service_account_key.external_dns_sa_key will be created
  + resource "google_service_account_key" "external_dns_sa_key" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.cluster.module.k8s.onepassword_item.apprise_admin will be created
  + resource "onepassword_item" "apprise_admin" {
      + category = "login"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-apprise-admin"
      + url      = "https://apprise.tiles.symmatree.com"
      + username = "apprise"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = ".htpasswd"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.apprise_env will be created
  + resource "onepassword_item" "apprise_env" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-apprise-env"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "config"

          + field {
              + id    = (known after apply)
              + label = "SECRET_KEY"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.cert_manager_dns01_sa_key will be created
  + resource "onepassword_item" "cert_manager_dns01_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-cert-manager-dns01-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "private_key.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.k8s.onepassword_item.external_dns_clouddns_sa_key will be created
  + resource "onepassword_item" "external_dns_clouddns_sa_key" {
      + category = "secure_note"
      + id       = (known after apply)
      + password = (sensitive value)
      + title    = "tiles-external-dns-clouddns-sa-key"
      + uuid     = (known after apply)
      + vault    = "lyyqeg3pe6dvqdeb5hbiu7b76y"

      + section {
          + id    = (known after apply)
          + label = "credentials"

          + field {
              + id    = (known after apply)
              + label = "credential.json"
              + type  = "CONCEALED"
              + value = (sensitive value)
            }
        }
      + section {
          + id    = (known after apply)
          + label = "metadata"

          + field {
              + id    = (known after apply)
              + label = "source"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "root_module"
              + type  = "STRING"
              + value = (sensitive value)
            }
          + field {
              + id    = (known after apply)
              + label = "module"
              + type  = "STRING"
              + value = (sensitive value)
            }
        }
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Control - 7211 - tiles-cp-1 - 10.0.128.11"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-cp-1"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g2p-1"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7211

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 2000
          + floating       = 2000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:72:11"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-cp-1"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.128.11"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-cp-1.local.symmatree.com."
      + mac                    = "bc:24:11:d0:72:11"
      + name                   = "tiles-cp-1"
      + note                   = "Control - 7211 - tiles-cp-1"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Control - 7212 - tiles-cp-2 - 10.0.128.12"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-cp-2"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g2p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7212

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 2000
          + floating       = 2000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:72:12"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-cp-2"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.128.12"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-cp-2.local.symmatree.com."
      + mac                    = "bc:24:11:d0:72:12"
      + name                   = "tiles-cp-2"
      + note                   = "Control - 7212 - tiles-cp-2"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Control - 7213 - tiles-cp-3 - 10.0.128.13"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-cp-3"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-1"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7213

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 2000
          + floating       = 2000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:72:13"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-cp-3"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.128.13"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-cp-3.local.symmatree.com."
      + mac                    = "bc:24:11:d0:72:13"
      + name                   = "tiles-cp-3"
      + note                   = "Control - 7213 - tiles-cp-3"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7221 - tiles-wk-1 - 10.0.128.21"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-wk-1"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g2p-1"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7221

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 7000
          + floating       = 7000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:72:21"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-wk-1"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.128.21"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-wk-1.local.symmatree.com."
      + mac                    = "bc:24:11:d0:72:21"
      + name                   = "tiles-wk-1"
      + note                   = "Worker - 7221 - tiles-wk-1"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7222 - tiles-wk-2 - 10.0.128.22"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-wk-2"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g2p-2"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7222

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 7000
          + floating       = 7000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:72:22"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-wk-2"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.128.22"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-wk-2.local.symmatree.com."
      + mac                    = "bc:24:11:d0:72:22"
      + name                   = "tiles-wk-2"
      + note                   = "Worker - 7222 - tiles-wk-2"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].proxmox_virtual_environment_vm.main will be created
  + resource "proxmox_virtual_environment_vm" "main" {
      + acpi                                 = true
      + bios                                 = "seabios"
      + boot_order                           = (known after apply)
      + delete_unreferenced_disks_on_destroy = true
      + description                          = "Worker - 7223 - tiles-wk-3 - 10.0.128.23"
      + id                                   = (known after apply)
      + ipv4_addresses                       = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + keyboard_layout                      = "en-us"
      + mac_addresses                        = (known after apply)
      + migrate                              = false
      + name                                 = "tiles-wk-3"
      + network_interface_names              = (known after apply)
      + node_name                            = "nuc-g3p-1"
      + on_boot                              = true
      + protection                           = false
      + purge_on_destroy                     = true
      + reboot                               = false
      + reboot_after_update                  = true
      + scsi_hardware                        = "virtio-scsi-single"
      + started                              = true
      + stop_on_destroy                      = false
      + tablet_device                        = true
      + tags                                 = []
      + template                             = false
      + timeout_clone                        = 1800
      + timeout_create                       = 1800
      + timeout_migrate                      = 1800
      + timeout_move_disk                    = 1800
      + timeout_reboot                       = 1800
      + timeout_shutdown_vm                  = 1800
      + timeout_start_vm                     = 1800
      + timeout_stop_vm                      = 300
      + vm_id                                = 7223

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cdrom {
          + enabled   = false
          + file_id   = (known after apply)
          + interface = "ide2"
        }

      + cpu {
          + cores      = 3
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "x86-64-v3"
          + units      = (known after apply)
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "none"
          + datastore_id      = "local-lvm"
          + discard           = "ignore"
          + file_format       = "raw"
          + interface         = "scsi0"
          + iothread          = true
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 32
          + ssd               = false
        }

      + memory {
          + dedicated      = 11000
          + floating       = 11000
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device {
          + bridge      = "vmbr0"
          + enabled     = true
          + firewall    = true
          + mac_address = "bc:24:11:d0:72:23"
          + model       = "virtio"
          + mtu         = 1
          + queues      = 16
          + rate_limit  = 0
          + vlan_id     = 0
        }

      + operating_system {
          + type = "l26"
        }

      + vga (known after apply)
    }

  # module.cluster.module.talos-vm["tiles-wk-3"].unifi_user.vm_client will be created
  + resource "unifi_user" "vm_client" {
      + allow_existing         = true
      + fixed_ip               = "10.0.128.23"
      + hostname               = (known after apply)
      + id                     = (known after apply)
      + ip                     = (known after apply)
      + local_dns_record       = "tiles-wk-3.local.symmatree.com."
      + mac                    = "bc:24:11:d0:72:23"
      + name                   = "tiles-wk-3"
      + note                   = "Worker - 7223 - tiles-wk-3"
      + site                   = (known after apply)
      + skip_forget_on_destroy = false
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_managed_zone.public[0] will be created
  + resource "google_dns_managed_zone" "public" {
      + creation_time    = (known after apply)
      + description      = "Managed by Terraform"
      + dns_name         = "tiles.symmatree.com."
      + effective_labels = {
          + "cluster"                    = "tiles"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "cluster" = "tiles"
          + "name"    = "tiles"
        }
      + managed_zone_id  = (known after apply)
      + name             = "tiles"
      + name_servers     = (known after apply)
      + project          = "tiles-main-1de4"
      + terraform_labels = {
          + "cluster"                    = "tiles"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "tiles"
        }
      + visibility       = "public"

      + cloud_logging_config {
          + enable_logging = false
        }

      + dnssec_config (known after apply)
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["/NS"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles"
      + name         = "tiles.symmatree.com."
      + project      = "tiles-main-1de4"
      + rrdatas      = [
          + "ns.tiles.symmatree.com.",
        ]
      + ttl          = 300
      + type         = "NS"
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["localhost/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles"
      + name         = "localhost.tiles.symmatree.com."
      + project      = "tiles-main-1de4"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

  # module.cluster.module.k8s.module.dns-public-zone.google_dns_record_set.cloud-static-records["ns/A"] will be created
  + resource "google_dns_record_set" "cloud-static-records" {
      + id           = (known after apply)
      + managed_zone = "tiles"
      + name         = "ns.tiles.symmatree.com."
      + project      = "tiles-main-1de4"
      + rrdatas      = [
          + "127.0.0.1",
        ]
      + ttl          = 300
      + type         = "A"
    }

Plan: 38 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ all_node_ips         = [
      - "10.0.192.11",
      - "10.0.192.21",
      + "10.0.128.11",
      + "10.0.128.12",
      + "10.0.128.13",
      + "10.0.128.21",
      + "10.0.128.22",
      + "10.0.128.23",
    ]
  ~ bootstrap_node       = "10.0.192.11" -> "10.0.128.11"
  ~ cluster_endpoint     = "https://10.0.192.10:6443" -> "https://10.0.128.10:6443"
  ~ control_plane_config = (sensitive value)
  ~ control_plane_ips    = [
      - "10.0.192.11",
      + "10.0.128.11",
      + "10.0.128.12",
      + "10.0.128.13",
    ]
  ~ control_plane_vip    = "10.0.192.10" -> "10.0.128.10"
  ~ talosconfig          = (sensitive value)
  ~ worker_config        = (sensitive value)

  ```

  </details>
  
  